<pad>	0
<unk>	0
<num>	0
the	191492
and	138715
a	102109
to	84965
was	69329
I	68802
is	67411
of	57317
The	53362
for	47907
in	42876
it	33490
with	32726
food	31857
but	28975
you	27048
that	25727
are	23992
this	23539
were	22990
place	22669
on	22345
had	22209
we	22075
have	21867
not	21240
at	20839
great	18948
my	18335
good	17124
very	16767
service	16296
be	16007
they	15311
as	15125
so	13545
there	12731
restaurant	12402
We	12219
all	11502
our	11496
go	11225
like	10967
out	10444
from	10264
or	9915
-	9910
one	9903
an	9822
just	9655
best	9548
been	8843
if	8544
about	8531
time	8499
here	8460
get	8455
us	8271
by	8013
back	7917
This	7787
would	7703
your	7602
can	7384
their	7362
more	7015
will	6983
when	6968
only	6948
menu	6922
has	6790
which	6740
up	6676
really	6668
It	6462
staff	6419
too	6408
it's	6374
i	6183
some	6121
My	6120
dinner	6031
even	6013
me	5971
I've	5751
than	5666
what	5637
went	5512
wine	5497
other	5460
wait	5427
nice	5391
better	5386
night	5351
no	5266
always	5251
table	5242
don't	5024
little	5010
experience	5010
never	5004
well	4965
try	4855
also	4827
people	4808
friendly	4776
delicious	4737
recommend	4726
after	4581
They	4541
make	4535
bar	4519
friends	4446
excellent	4437
meal	4405
worth	4403
If	4388
A	4387
atmosphere	4326
who	4274
over	4253
much	4149
food,	3968
order	3952
because	3908
ever	3850
waiter	3839
dining	3811
dishes	3788
many	3777
eat	3774
could	3771
made	3709
ordered	3691
going	3652
love	3620
got	3608
sushi	3541
It's	3498
he	3496
its	3495
most	3468
drinks	3452
fresh	3431
times	3428
definitely	3415
want	3403
first	3346
came	3308
do	3276
any	3255
pizza	3232
prices	3231
small	3213
Great	3191
them	3189
wonderful	3140
then	3074
way	3071
last	3065
know	3056
chicken	3044
two	3043
few	3030
restaurants	2993
did	2992
bit	2976
find	2971
come	2960
didn't	2894
New	2881
bad	2880
price	2879
take	2875
before	2864
amazing	2845
every	2843
say	2841
think	2810
And	2809
good,	2789
seated	2758
steak	2755
down	2752
around	2747
minutes	2714
right	2694
room	2637
Food	2632
special	2623
perfect	2618
still	2617
though	2610
decor	2597
You	2596
again	2596
dessert	2578
how	2565
NYC	2562
while	2553
feel	2553
took	2538
can't	2538
new	2534
pretty	2526
I'm	2512
But	2473
off	2452
quality	2420
city	2417
friend	2410
sauce	2397
party	2371
lunch	2368
am	2367
should	2360
where	2358
everything	2304
places	2294
served	2268
you're	2261
favorite	2260
There	2245
cheese	2227
fish	2224
long	2223
into	2219
looking	2214
Service	2214
taste	2199
tasty	2197
salad	2186
being	2185
attentive	2184
quite	2158
dish	2158
group	2155
list	2152
tried	2141
such	2140
highly	2125
nothing	2117
When	2113
since	2107
--	2103
asked	2101
told	2095
both	2094
must	2082
enough	2080
Italian	2071
waitress	2064
sure	2056
Our	2054
without	2053
next	2052
portions	2050
found	2030
another	2030
she	2023
tables	2015
something	1986
fun	1981
For	1972
years	1963
large	1961
neighborhood	1933
thing	1932
area	1923
away	1921
service,	1881
York	1874
Not	1874
see	1870
reservation	1867
In	1865
especially	1854
great,	1841
his	1837
big	1821
top	1811
ambience	1787
music	1786
romantic	1782
drink	1778
date	1747
enjoy	1741
THE	1740
each	1726
After	1713
hot	1707
hour	1699
left	1692
once	1685
makes	1677
spot	1674
her	1670
different	1662
wasn't	1661
check	1658
loved	1657
same	1647
give	1636
chocolate	1632
lot	1629
home	1623
side	1612
disappointed	1609
live	1609
said	1596
selection	1596
reviews	1592
else	1590
now	1585
almost	1578
average	1578
appetizer	1574
brunch	1571
eating	1566
thought	1554
appetizers	1549
ask	1548
day	1545
extremely	1544
fantastic	1538
warm	1532
tasted	1529
visit	1526
enjoyed	1523
real	1504
far	1504
reasonable	1486
birthday	1485
evening	1485
everyone	1479
week	1470
those	1457
What	1452
pasta	1442
bread	1433
sit	1429
high	1429
waiting	1429
money	1425
least	1424
absolutely	1421
space	1421
All	1412
need	1405
expensive	1403
waiters	1400
full	1400
meat	1394
As	1385
entrees	1382
anything	1365
rude	1354
coffee	1350
actually	1340
couple	1334
ambiance	1329
several	1322
shrimp	1321
crowded	1319
manager	1318
beautiful	1307
whole	1303
family	1301
desserts	1293
wanted	1291
main	1286
value	1282
less	1280
having	1275
work	1274
Very	1274
yet	1273
bring	1272
reservations	1272
things	1266
crowd	1254
outside	1252
Don't	1250
cold	1241
brought	1240
fried	1239
place,	1236
course	1228
three	1227
Try	1227
sweet	1223
may	1221
look	1213
these	1212
why	1209
prepared	1206
authentic	1205
seafood	1205
cool	1202
hard	1200
that's	1195
eaten	1195
happy	1193
half	1192
leave	1186
priced	1186
recommended	1185
soup	1180
Good	1180
expect	1177
cozy	1176
old	1174
chef	1162
NY	1158
anyone	1157
One	1157
Went	1154
cooked	1154
cake	1153
waited	1152
kind	1145
bill	1145
huge	1139
kitchen	1135
sat	1130
won't	1127
busy	1124
coming	1124
glass	1123
However,	1119
couldn't	1117
cheap	1111
boyfriend	1110
during	1110
decided	1106
rice	1105
felt	1104
decent	1103
does	1092
I'd	1087
you'll	1086
entree	1082
getting	1081
pleasant	1081
although	1074
open	1073
He	1073
seating	1073
used	1071
owner	1071
flavor	1070
ate	1068
server	1066
lobster	1064
pork	1064
arrived	1064
Their	1063
fries	1063
until	1062
grilled	1060
beef	1059
probably	1058
Everything	1052
trying	1050
late	1049
return	1048
it,	1043
wrong	1042
pay	1037
burger	1033
AND	1030
put	1029
wife	1028
person	1023
So	1021
close	1021
No	1014
cream	1011
waitstaff	1011
isn't	1011
keep	1008
plate	1004
seemed	1001
gave	997
red	996
hostess	996
part	995
tuna	992
spicy	990
French	990
helpful	989
finally	986
fine	978
tell	975
location	974
town	969
water	969
usually	966
bottle	963
slow	962
husband	959
worst	955
comes	954
truly	953
Saturday	952
restaurant,	951
doesn't	948
end	941
lamb	939
ice	938
tasting	937
rolls	932
let	930
Thai	924
often	920
loud	920
second	918
door	914
looked	911
regular	903
through	902
simply	895
might	894
making	893
overall	891
past	890
fabulous	886
done	885
own	884
duck	883
street	879
delicious,	879
menu,	878
front	878
impressed	877
serve	874
heard	873
business	872
walked	872
awesome	871
recently	869
trip	863
Manhattan	863
die	863
Scene	863
outstanding	859
white	857
friendly,	855
either	854
cuisine	854
bland	850
specials	849
world	847
house	846
salmon	845
While	842
Mexican	842
variety	841
(and	839
Just	836
quick	833
excellent,	832
perfectly	832
rather	831
Although	827
stop	826
it!	825
interesting	818
Go	811
Japanese	811
attitude	808
,	806
fast	806
ago	805
comfortable	805
overpriced	804
seems	803
surprised	797
someone	796
Indian	795
time,	794
hours	794
Even	793
him	790
twice	790
I'll	788
beer	786
gets	782
simple	782
flavors	779
burgers	777
called	776
offer	776
customers	774
believe	769
mediocre	769
early	769
unique	768
year	767
weekend	765
walk	762
line	757
wines	754
seem	753
care	750
soon	749
meals	749
NOT	748
Definitely	748
terrible	743
packed	743
atmosphere,	741
deal	739
there,	739
ok	738
On	737
wouldn't	733
all,	732
entire	727
french	726
choice	725
completely	723
items	722
inside	719
Sunday	717
they're	716
lovely	714
sitting	713
certainly	712
rest	710
tea	710
servers	709
night,	709
name	708
free	708
incredible	707
started	707
)	706
Friday	705
given	704
yourself	701
empty	697
mouth	694
read	694
Overall,	693
totally	692
sandwich	689
Its	687
poor	686
review	685
start	684
choices	684
style	684
kept	683
nice,	681
maybe	680
fact	680
problem	675
tiny	674
under	673
here,	673
garden	672
light	670
host	669
across	669
between	668
treated	667
pricey	667
true	666
instead	666
From	665
later	664
East	663
horrible	662
mind	662
tip	661
girlfriend	661
roll	660
seen	659
seat	658
show	657
use	656
four	656
crab	655
however,	655
italian	655
miss	655
dry	654
TO	653
Also,	648
casual	647
dine	647
opened	646
ingredients	646
corner	646
above	644
bartender	642
size	641
plates	640
liked	640
At	638
setting	638
trendy	638
To	637
able	634
there's	633
extra	633
call	632
including	629
With	627
homemade	624
looks	623
dinner,	623
Highly	622
fresh,	622
dont	619
cute	618
offered	618
etc	618
Chinese	616
reasonably	614
She	613
Had	613
meal,	611
quickly	604
Best	604
feeling	604
table,	603
forget	603
ordering	601
ribs	601
traditional	601
lots	599
superb	599
short	599
Sushi	598
yummy	597
reason	595
(the	594
scene	593
point	591
wine,	590
portion	589
stuffed	589
delivery	587
flavorful	585
expected	585
others	585
stay	582
gone	581
drinks,	579
tastes	578
slice	578
IS	576
spend	575
Excellent	575
rushed	574
City	573
understand	573
(I	573
saw	572
vegetarian	572
myself	571
w/	571
treat	571
quiet	571
summer	571
groups	570
tapas	570
offers	570
green	566
itself	566
diner	566
garlic	565
small,	565
near	564
tender	558
potatoes	558
mention	554
choose	554
along	553
incredibly	552
bar,	552
black	549
Village	548
Nice	547
great!	545
Then	544
promptly	542
sandwiches	541
Brooklyn	540
already	540
anywhere	540
place!	539
taken	539
margaritas	539
plenty	538
finish	538
cocktails	538
filled	536
needs	535
pie	535
run	535
sometimes	534
guess	532
Park	532
local	531
serves	530
set	529
change	529
remember	528
salads	528
filet	526
help	526
fare	525
Short	523
together	523
outdoor	523
lounge	523
super	522
plus	521
available	521
owners	521
low	519
sangria	518
GREAT	518
mixed	517
attention	516
WAS	516
received	515
crust	514
cannot	513
beat	510
become	510
taking	507
hungry	506
serving	506
customer	506
guests	504
courses	502
ended	501
tomato	501
cost	500
steaks	499
me,	497
weren't	495
presentation	495
terrific	495
however	495
stuff	495
creative	494
view	493
needed	492
salad,	490
hear	487
bite	486
immediately	485
reading	483
per	483
inexpensive	483
awful	482
spent	482
That	482
glasses	482
VERY	481
charming	481
minute	479
affordable	479
add	478
wish	478
staff,	478
upon	478
days	477
turned	477
attentive,	477
upstairs	477
dumplings	477
type	476
knew	476
spinach	475
orders	475
charge	474
Cafe	474
Overall	474
lived	474
joint	474
options	473
amount	472
(which	472
clean	471
dined	471
tasty,	471
typical	470
consistently	470
mix	470
mood	467
Everyone	466
life	466
head	465
visited	465
prompt	465
share	461
i've	461
amazing,	461
guy	460
definately	459
downstairs	459
rare	456
hang	456
slightly	456
gem	454
dessert,	454
crispy	454
vibe	453
diners	452
calamari	452
professional	452
dishes,	451
idea	451
negative	450
shared	450
paying	449
walking	447
guys	447
us,	446
that,	446
times,	445
well,	445
fan	444
Some	443
weeks	443
visiting	442
moved	442
disappointing	440
Chicken	439
salty	439
considering	437
number	437
ready	436
piece	436
Also	434
sea	434
prix	434
suggest	433
elsewhere	433
intimate	433
potato	433
conversation	432
sauce,	432
Every	431
desert	429
somewhere	428
please	428
write	427
baked	427
out,	427
American	427
butter	427
kids	425
cafe	425
paid	425
rich	425
easy	423
doing	423
Maybe	423
pieces	421
behind	421
cramped	421
haven't	419
floor	418
presented	418
chance	417
exceptional	416
relaxed	416
West	415
favorites	415
unless	414
waste	414
watch	413
forward	413
below	412
Restaurant	412
cut	412
nights	412
finished	412
veal	412
Italy	411
months	410
parties	409
particularly	409
dark	408
thai	408
hit	408
soft	408
aren't	407
breakfast	407
Blue	407
glad	406
classic	406
addition	406
takes	406
include	405
generous	404
fixe	404
somewhat	404
surprise	403
mean	402
pleasantly	401
expecting	399
roasted	398
patrons	398
sake	397
decor,	396
enjoyable	395
spectacular	395
ravioli	395
There's	394
back!	394
BEST	393
Once	392
noodles	391
limited	391
BBQ	390
walls	390
standard	390
sides	389
ones	388
east	388
beyond	387
touch	387
cooking	387
Only	387
meet	386
added	386
experiences	386
pick	386
knowledgeable	385
chinese	385
accomodating	385
level	384
despite	384
polite	384
Do	383
too!	383
experience,	382
strong	382
cupcakes	381
eggs	380
hope	379
oil	378
Pizza	378
expectations	377
First	376
management	376
though,	376
five	375
talking	375
pleased	375
selections	375
private	374
cup	374
establishment	372
rush	372
except	371
worse	371
appetizer,	371
among	371
raw	370
greeted	370
bartenders	370
THIS	369
scallops	369
curry	369
cakes	368
Both	368
noisy	366
month	366
bistro	365
hip	365
room,	364
asking	364
IT	363
back,	362
matter	361
saying	361
lighting	361
you've	360
friends,	360
impressive	360
stopped	360
people,	360
mexican	360
exactly	359
counter	358
(not	358
middle	357
ok,	357
welcome	356
chips	356
thin	356
city,	356
popular	355
alone	355
downtown	355
agree	355
Street	355
FOR	355
mashed	354
barely	353
again,	353
chicken,	353
talk	352
interior	351
Yes,	351
!	351
young	351
perfection	351
NYC,	350
moment	349
okay	348
goat	348
word	348
nicely	347
appetizers,	347
courteous	347
easily	346
afternoon	346
friend's	346
steak,	345
crowded,	344
wonderful,	344
cocktail	344
delicious!	343
Will	343
fairly	343
arrive	343
job	342
corn	342
satisfied	342
prices,	342
menus	340
block	340
order,	339
Bar	339
bother	339
Most	339
single	339
bass	339
goes	337
Since	337
comfort	336
overly	336
onion	336
within	335
Chef	335
de	334
oysters	334
slices	333
plain	333
forgot	333
changed	333
you,	332
didnt	331
literally	330
say,	330
in,	330
known	330
beans	330
Korean	329
area,	329
frozen	329
bad,	328
relaxing	328
wall	328
waitresses	328
original	328
An	327
sent	327
Would	327
nearly	326
knows	326
happened	326
save	326
sauces	326
due	326
delightful	326
complaint	325
hands	325
fruit	324
St	324
cook	324
tasteless	323
range	323
hype	322
lack	322
OF	322
filling	321
apple	321
seats	321
baby	320
mostly	320
we've	319
IN	319
impeccable	319
charged	318
dim	318
excited	318
mussels	318
music,	318
feels	317
FOOD	317
watching	317
move	316
sushi,	316
cheese,	316
longer	316
Prices	316
La	315
(a	315
food!	315
weekends	315
famous	315
previous	313
stand	313
reservation,	312
avoid	312
combination	311
forever	310
upscale	310
recent	310
working	310
extensive	310
notch	310
Nothing	309
sashimi	309
juicy	308
none	308
SO	307
plan	307
vegetables	307
speak	306
Though	305
pizza,	305
fair	304
credit	304
midtown	304
sausage	304
coconut	304
efficient	303
Never	303
Can't	302
Now	301
elegant	301
mine	301
course,	300
average,	300
upper	300
guacamole	300
bunch	299
Square	299
grab	299
wood	299
beautifully	299
cant	299
ambience,	299
b/c	298
solid	298
experienced	298
greasy	298
satisfying	297
sort	297
fish,	297
mushrooms	297
medium	297
obviously	295
price,	295
modern	295
bacon	295
store	295
brick	294
Too	294
occasion	294
mushroom	294
OK	293
Grill	293
disappointment	292
said,	292
anniversary	292
$20	292
salsa	292
buy	292
noodle	292
Staff	292
By	291
mango	290
spring	290
means	290
Side	289
surprisingly	289
oven	289
Be	289
NEVER	288
otherwise	288
welcoming	288
window	287
fun,	287
entrees,	286
Have	286
toast	286
pastas	286
smile	285
inviting	285
years,	285
wait,	285
included	285
total	285
met	285
creamy	284
egg	284
salt	284
YOU	284
delivered	283
noticed	283
Make	283
Upper	283
leaving	282
village	282
too,	282
Get	281
stick	280
lost	280
usual	280
bottles	280
memorable	280
fantastic,	279
phone	279
Steak	279
perhaps	279
platter	278
go,	278
lemon	278
fancy	277
supposed	277
round	277
(we	277
whether	277
Asian	277
amazing!	277
Thank	277
vegetable	277
bagels	277
1/2	276
How	275
environment	275
min	275
hand	274
chose	274
celebrate	274
mac	274
$10	273
mignon	273
blue	273
cheap,	273
hidden	273
mistake	273
steakhouse	273
Two	272
personal	272
tough	272
equally	271
Other	271
Well,	271
beers	271
clearly	271
topped	271
chairs	270
best,	270
Dinner	270
LOVE	270
bucks	269
turn	269
restaurants,	269
fill	268
GO	268
recommendation	268
returning	268
is,	268
again!	268
gotten	266
nor	266
WE	266
Love	265
overcooked	265
showed	264
Wine	264
complain	263
nearby	263
roast	263
complete	263
Chinatown	263
refreshing	263
pancakes	262
Unfortunately,	262
olive	261
banana	261
pudding	261
risotto	261
foie	261
loud,	260
Having	260
pretentious	260
blocks	260
girl	260
you'd	259
soup,	259
cod	258
complimentary	258
advance	258
difficult	258
toppings	258
thinking	256
Ave	256
chefs	255
based	255
heavy	255
pass	255
dollars	254
expensive,	254
decorated	254
class	254
par	254
Was	253
Times	252
gras	252
had,	251
shop	251
Well	251
daily	251
discovered	250
girls	250
willing	250
sour	250
secret	250
larger	250
west	249
warm,	248
bathroom	248
leaves	248
creme	248
gives	248
suggested	247
enjoying	247
returned	247
bowl	247
split	247
martini	246
playing	246
drinking	246
cheesecake	246
Despite	246
rave	245
wonder	245
living	245
man	245
pricey,	245
clear	245
request	245
slow,	244
time!	244
generally	244
pleasure	244
dish,	244
good!	243
better,	243
chops	243
basically	242
throughout	242
(	241
parents	241
Spanish	241
jazz	241
lacking	241
inventive	241
includes	241
ignored	241
off,	241
Oh	240
These	240
Little	240
stumbled	239
doubt	239
tables,	238
side,	238
impress	237
pizzas	237
gorgeous	237
seared	237
sense	237
noise	237
fact,	237
anyway	236
air	236
whatever	236
eggplant	236
theater	236
MY	236
unbelievable	235
eye	235
lunch,	235
located	235
giving	235
cash	235
wide	235
consider	234
running	234
culinary	234
Really	234
positive	234
Greek	234
Always	233
:)	233
complained	233
We've	233
fix	233
loves	233
NO	232
Last	232
couples	232
ago,	232
boring	232
resturant	231
york	231
seated,	231
says	231
ALL	230
lucky	230
way,	230
we're	230
compared	230
heart	230
skip	229
provide	229
charm	229
ambiance,	229
Oh,	228
ten	228
refused	228
down,	228
up,	228
restaurant's	228
pepper	228
2nd	227
veggie	227
ahead	227
Big	227
Le	227
cozy,	227
reviews,	226
sorry	226
types	226
romantic,	226
Each	226
day,	226
neighborhood,	226
reservations,	226
thick	226
wings	226
healthy	225
became	225
special,	225
missing	225
dressing	225
minutes,	225
But,	225
quaint	225
Monday	225
six	224
prefer	224
smaller	224
card	223
relax	223
tart	223
PLACE	223
patio	223
spots	222
BUT	222
deliver	222
basic	221
Day	221
sample	221
WITH	221
relatively	220
fine,	219
possible	219
crisp	219
Place	218
star	218
tourists	218
la	218
foods	218
design	218
hearty	218
Avenue	218
gnocchi	218
smoked	218
morning	218
various	217
option	217
Desserts	217
steamed	217
(they	216
decent,	216
laid	216
lively	215
York,	215
numerous	215
entree,	215
was,	215
club	215
appreciate	215
checked	214
HAVE	214
list,	214
consistent	214
decide	214
worked	214
rating	214
week,	214
reviewers	213
lit	213
portions,	213
rude,	213
regulars	213
hate	213
waiter,	212
seasoned	212
fusion	212
clams	212
sum	212
indian	212
heaven	211
imagine	211
soups	210
craving	210
mentioned	210
dinners	210
crazy	210
sister	210
bean	210
complaints	210
date,	209
oh	209
lower	209
eat,	209
similar	209
favor	209
Nobu	208
Of	208
bright	208
Thursday	208
takeout	208
bringing	208
themselves	208
Being	207
absolute	207
burnt	207
alot	207
melted	207
occasions	206
informed	206
japanese	206
practically	205
That's	205
reccomend	205
thats	204
item	204
we'd	204
describe	204
everytime	204
serious	204
hardly	204
tomatoes	204
picked	203
case	203
mins	203
requested	203
dozen	203
school	202
mozzarella	202
i'm	202
break	202
orange	202
exotic	202
gourmet	201
and,	200
dissapointed	200
divine	200
Tuesday	200
wrapped	200
meats	200
Chocolate	200
bakery	200
mojitos	199
hanging	199
bigger	199
greens	199
shell	199
shrimp,	199
brunch,	199
spending	199
rate	199
DJ	198
play	198
recommendations	198
crowd,	198
band	198
drink,	198
words	198
Thanks	198
Shrimp	198
prime	198
Who	197
frequent	197
THAT	197
but,	197
owner,	197
children	196
thank	196
saturday	196
u	196
$5	196
soggy	196
take-out	195
reviewer	195
sign	195
apps	195
frites	195
face	195
ourselves	194
country	194
onions	194
specialty	194
signature	194
cheaper	193
tourist	193
dressed	193
(or	193
grill	193
Red	192
ridiculous	192
girlfriends	192
bread,	192
$100	192
(but	192
opening	192
gracious	192
You'll	192
hold	192
works	192
space,	192
Drinks	191
guest	191
movie	191
HAD	191
salads,	190
classy	190
(with	190
yes,	190
placed	190
wild	190
dates	190
tofu	190
chop	189
exquisite	189
uncomfortable	189
folks	189
fell	189
thanks	189
chili	188
dance	188
chic	188
hotel	188
ran	188
windows	188
Another	187
Sat	187
version	187
Why	187
match	187
okay,	187
lights	186
martinis	186
Kitchen	186
cool,	186
attractive	186
realize	186
SERVICE	186
quality,	186
rib	186
Brunch	186
annoying	185
busy,	185
closed	185
desserts,	185
savory	185
rated	185
possibly	185
snapper	185
Starbucks	185
lovers	184
arrived,	184
broth	184
bargain	184
peanut	184
vanilla	184
dogs	184
helped	183
freshest	183
perfect,	183
phenomenal	183
seeing	183
they've	182
experience!	182
(especially	182
catch	182
honestly	182
Tuna	182
art	182
wonderfully	182
notice	182
cookies	182
standing	181
tight	181
beautiful,	181
higher	181
outside,	181
GOOD	181
unusual	181
shame	181
wasnt	181
octopus	181
admit	180
cold,	180
OK,	180
offering	180
meat,	180
pastries	180
dog	180
milk	180
moist	179
straight	179
Perfect	179
clients	179
parking	179
asparagus	179
followed	179
restaurant!	179
ginger	179
stayed	179
box	179
Peter	179
weather	178
eatery	178
so-so	178
House	178
wallet	178
friday	178
simple,	178
buffet	178
tacos	178
ceiling	177
Ive	177
candles	177
chill	177
problems	177
agreed	177
Friendly	177
certain	177
company	176
what's	176
texture	176
here!	176
juice	176
coffee,	176
pulled	176
ruined	176
we'll	175
shot	175
crowds	175
South	175
explained	175
reminded	175
suggestions	174
sliced	174
pad	174
town,	174
spice	174
adds	174
important	174
brown	174
keeps	173
features	173
out!	173
Delicious	173
fit	173
missed	173
Save	173
opinion	173
realized	173
whenever	173
bland,	173
fat	173
greatest	173
sweet,	173
organic	173
later,	173
regret	172
Like	172
Been	172
heavenly	172
compare	172
lines	172
margarita	172
telling	172
Portions	171
tempura	171
obnoxious	171
Check	171
Next	171
bottom	171
smell	171
delight	171
bought	171
bagel	171
sexy	170
covered	170
Cuban	170
dirty	170
Decor	170
accommodating	170
today	170
game	169
bars	169
Wonderful	169
pot	169
now,	169
location,	169
district	169
nyc	168
travel	168
normal	168
wants	168
penny	168
checking	168
before,	168
champagne	168
Take	168
melts	168
deep	168
Vietnamese	168
ARE	168
event	168
flavor,	168
walls,	168
eyes	167
sharing	167
long,	167
rolls,	167
Sea	167
Bistro	167
miso	167
picky	167
sunday	167
Amazing	166
detail	166
park	166
$30	166
desired	166
hearing	166
Queens	166
continue	166
delicate	165
familiar	165
deserts	165
So,	165
ONE	165
MUST	165
soy	165
earlier	165
chewy	164
step	164
thoroughly	164
winter	164
burger,	164
Worth	164
Slope	164
burgers,	163
allowed	163
evening,	163
send	163
Plus,	163
everywhere	163
hadn't	163
particular	162
right,	162
yes	162
amazed	162
standards	162
sized	162
al	162
braised	162
overpriced,	162
citysearch	162
funny	162
AT	162
paper	162
locals	161
dinning	161
visits	161
priced,	161
Tavern	161
third	160
treats	160
$25	160
candle	160
anymore	160
Lobster	160
overall,	160
AMAZING	160
explain	160
Valentine's	160
flavored	160
Finally,	160
$8	159
$2	159
cuisine,	159
Dessert	159
booth	159
DO	159
truffle	159
Atmosphere	159
site	159
woman	159
recomend	159
ribs,	159
Citysearch	159
nicer	158
stomach	158
personally	158
dollar	158
for,	158
dipping	158
Salmon	158
for!	158
asian	158
knowledgable	158
disappoint	158
dancing	158
delectable	158
fall	157
questions	157
turkey	157
People	157
restuarant	157
eats	157
he's	157
(for	157
(although	157
them,	157
ON	157
exciting	157
book	157
Fresh	157
cupcake	157
chain	156
wanting	156
advice	156
happen	156
clientele	156
Plus	156
seriously	155
homey	155
strawberry	155
large,	155
Finally	155
boy	155
e	155
combo	155
one,	155
spices	155
value,	155
unpretentious	155
varied	155
kick	155
1st	155
pasta,	155
20%	155
outstanding,	155
Upon	154
Loved	154
basil	154
ceviche	154
water,	154
manager,	154
shocked	154
sauteed	154
THEY	154
Island	154
succulent	154
fondue	154
money,	153
yellow	153
dry,	153
till	153
spacious	153
maitre	153
excellent!	153
office	153
$12	153
away,	152
key	152
kinda	152
booths	152
Absolutely	152
enough,	152
spoke	152
$15	152
difference	152
pies	152
Turkish	152
managed	151
reputation	151
clean,	151
(even	151
amazingly	151
written	151
changes	151
normally	151
And,	151
unlike	150
beginning	150
HUGE	150
Sangria	150
tiramisu	150
pleasant,	150
S	150
Duck	150
terms	150
biggest	150
tend	150
moving	150
finest	150
Il	150
rock	149
funky	149
rice,	149
spot,	149
combinations	149
mom	149
stuffy	148
shopping	148
reasonable,	148
effort	148
Please	147
paella	147
innovative	147
blown	147
frequently	147
tired	147
Perhaps	147
They're	147
section	147
Chelsea	147
Room	147
impossible	146
brings	146
freshly	146
southern	146
interested	146
Mr	146
brulee	146
El	146
pitcher	145
visit,	145
wedding	145
rooms	145
Fish	145
major	145
stuck	145
English	145
salmon,	145
John's	145
there!	144
assortment	144
ordinary	144
overrated	144
sugar	144
sampler	144
excuse	144
door,	144
lover	144
places,	143
wooden	143
gelato	143
reserved	143
passed	143
Order	143
$50	143
theatre	143
fries,	143
We'll	143
lettuce	143
porterhouse	143
this,	142
onto	142
helpful,	142
fiance	142
belly	142
uptown	142
deli	142
multiple	142
unbelievably	142
pm	142
heat	142
drop	141
poorly	141
costs	141
diverse	141
eclectic	141
satisfy	141
provided	141
shouldn't	141
rarely	141
(no	141
creamed	141
clam	141
women	141
melt	141
lives	140
unfortunately	140
(if	140
shows	140
$7	140
flat	140
buttery	140
chef's	140
lime	140
nite	140
refill	139
tartare	139
sounds	139
kitchen,	139
comment	139
apology	139
sandwiches,	139
ideal	139
general	138
Where	138
(as	138
meeting	138
Menu	138
luck	138
further	138
basket	138
kinds	138
on,	138
rustic	138
tad	138
Cheese	137
Salad	137
mousse	137
THERE	137
likely	137
Many	137
pastry	137
sound	137
south	137
sesame	137
However	136
doors	136
$3	136
inedible	136
weird	136
hoping	136
begin	136
$6	136
Green	136
selection,	136
sommelier	136
$4	135
dropped	135
additional	135
much,	135
had!	135
crunchy	135
offerings	135
pre-theater	135
Needless	134
avocado	134
apparently	134
comments	134
double	134
afterwards	134
deserves	134
REALLY	134
spaghetti	134
everybody	134
Come	134
veggies	134
Burger	134
group,	133
coat	133
+	133
designed	133
proceeded	133
Yes	133
Wednesday	133
sophisticated	133
once,	133
towards	133
nasty	133
burrito	133
taste,	133
party,	132
impression	132
smoke	132
sooo	132
lousy	132
reliable	132
cause	132
bag	132
answer	132
meant	132
question	132
bathrooms	131
bet	131
staying	131
incredible,	131
best!	131
(try	131
himself	131
bill,	130
hamburger	130
Paris	130
using	130
big,	130
prepare	130
Beef	130
planning	130
/	130
provides	130
lasagna	130
joke	130
stale	130
damn	129
hot,	129
throw	129
so,	129
blend	129
older	129
fantastic!	129
lacked	129
friend,	129
Long	129
plentiful	129
WILL	129
joints	129
scene,	128
spanish	128
square	128
undercooked	128
vodka	128
welcomed	128
flavorful,	128
con	128
EVER	128
subtle	128
Grand	128
grew	128
steakhouses	128
draw	127
ladies	127
iced	127
strongly	127
bus	127
college	127
ridiculously	127
tonight	127
scrumptious	127
bbq	127
following	127
couldnt	127
Broadway	127
BE	127
seating,	127
service!	127
soda	126
array	126
extraordinary	126
Especially	126
honey	126
future	126
palate	126
breast	126
huge,	126
hole	126
Ribbon	126
sublime	126
sad	126
trust	126
threw	126
entertainment	125
finding	125
lighting,	125
Soho	125
likes	125
Three	125
they'll	125
accomodate	125
First,	125
cheeses	125
recommended!	125
mother	125
search	125
overwhelmed	125
Those	125
winner	124
played	124
rudely	124
Ambience	124
spiced	124
Beautiful	124
Fried	124
Entrees	124
(i	124
tender,	124
Sometimes	124
odd	124
beef,	124
Magnolia	124
au	123
constantly	123
background	123
described	123
tab	123
handle	123
neither	123
families	123
Raku	123
soul	123
daughter	122
outrageous	122
tons	122
Pad	122
came,	122
go!	122
NYC!	122
$9	122
dip	122
strange	122
crepes	122
pink	122
listed	122
=	122
ordered,	122
chunks	122
entrance	121
story	121
stood	121
sampled	121
sidewalk	121
men	121
dream	121
fabulous,	121
skirt	121
fast,	121
blast	121
lady	121
chat	121
tangy	121
marinated	121
comfortable,	121
apart	121
eager	121
Lots	121
allow	121
act	121
Ask	121
twist	121
$	120
appetite	120
receive	120
waitress,	120
around,	120
Keep	120
note	120
it)	120
Simply	120
Fantastic	120
lovely,	120
starters	120
Small	120
specials,	120
US	120
inside,	120
souffle	120
meatballs	120
awesome,	120
more,	120
vegan	120
city!	120
Im	119
gotta	119
flavorless	119
chopped	119
halibut	119
mediocre,	119
sorbet	119
tuna,	119
encountered	119
against	119
squid	119
home,	119
pear	119
(who	118
olives	118
@	118
Took	118
pumpkin	118
roll,	118
seafood,	118
overbearing	118
earth	118
espresso	118
hour,	118
Definately	118
plastic	117
terrible,	117
son	117
Happy	117
manhattan	117
create	117
packed,	117
European	117
trouble	117
cheesy	117
figured	117
actual	117
cream,	117
smooth	117
bloody	117
Manhattan,	116
Union	116
somehow	116
late,	116
raved	116
NY,	116
velvet	116
rack	116
scallop	116
beer,	116
yesterday	116
Is	116
WERE	116
hosts	116
superb,	115
theme	115
bustling	115
accompanied	115
celebration	115
center	115
thing,	115
Bay	115
pesto	115
failed	115
turns	115
artichoke	115
$1	115
inattentive	114
definetly	114
Avoid	114
More	114
former	114
drunk	114
reminds	114
Appetizers	114
Unfortunately	114
policy	114
WAY	114
snack	114
members	114
exception	114
train	114
beans,	114
Yorkers	114
hooked	114
giant	113
(in	113
listen	113
native	113
Fun	113
annoyed	113
app	113
to,	113
HIGHLY	113
knowing	113
apologize	113
bites	113
weekday	113
3rd	113
ground	113
$40	113
wont	113
bone	113
!!!	113
chef,	113
mini	112
wrong,	112
balance	112
potatoes,	112
Week	112
pan	112
cake,	112
deserve	112
quick,	112
highlight	112
superior	112
unpleasant	112
orders,	112
cuts	112
cute,	112
crust,	112
sizes	112
icing	112
repeat	112
Astoria	112
mess	111
disgusting	111
awhile	111
complaining	111
exceptionally	111
mustard	111
celebrated	111
cuban	111
pineapple	111
Did	111
Latin	111
(it	111
Waiter	111
Because	111
Garden	111
began	111
cooks	111
created	111
hurry	111
pop	111
night!	111
liquor	111
rocks	111
boys	110
fare,	110
Stay	110
Old	110
cover	110
hint	110
world,	110
EXCELLENT	110
alternative	110
Whether	110
Must	110
two,	110
(including	110
figure	110
entered	110
servings	110
Lombardi's	110
vegetarians	110
thrilled	110
falafel	110
appealing	109
ALWAYS	109
apologized	109
pure	109
!!	109
patient	109
Can	109
colorful	109
cares	109
terribly	109
oily	109
mint	109
partner	109
Lunch	109
festive	109
OUT	109
not,	109
casual,	108
concerned	108
fireplace	108
quiet,	108
duck,	108
downside	108
entertaining	108
count	108
energy	108
employees	108
delighted	108
gratuity	108
buck	108
watering	108
His	108
IF	108
spread	107
Bring	107
forced	107
surprising	107
twice,	107
person,	107
Your	107
Spice	107
surely	107
afford	107
Better	107
Came	107
ingredients,	107
Skip	107
website	107
arrives	107
penne	107
pushy	107
Dont	107
Crab	106
def	106
respect	106
definite	106
stylish	106
JUST	106
ceilings	106
overwhelming	106
Anyway,	106
hours,	106
insisted	106
authentic,	106
drawback	106
situation	106
Pasta	106
regularly	106
personable	106
form	106
correct	106
named	106
starting	106
p	106
opted	105
kid	105
adequate	105
treatment	105
seasonal	105
nicest	105
strip	105
budget	105
sirloin	105
tea,	105
During	105
minimum	105
obvious	105
d'	105
dumplings,	105
common	105
noisy,	105
Joe's	105
prepared,	105
ONLY	105
fatty	105
polenta	105
(though	105
building	104
writing	104
kobe	104
pricy	104
far,	104
poached	104
Central	104
(at	104
full,	104
(like	104
booked	104
Hot	104
freshness	104
birthday,	104
Tribeca	104
fans	103
ride	103
soooo	103
pub	103
anytime	103
Otherwise,	103
Southern	103
dough	103
varieties	103
enormous	103
Lamb	103
pleasing	103
dried	103
thrown	103
everyday	103
separate	103
weak	103
LES	103
maitre'd	103
concept	102
waiters,	102
buzz	102
stellar	102
San	102
try,	102
lacks	102
prior	102
crave	102
peak	102
foot	102
RESTAURANT	102
buns	102
unfriendly	102
gift	102
m	102
crusted	102
Let	102
Williamsburg	102
Babbo	102
steaks,	102
Pork	101
cards	101
convenient	101
thumbs	101
comfy	101
top-notch	101
Unlike	101
hostesses	101
raving	101
fixed	101
YOUR	101
know,	101
sell	101
White	101
attitude,	101
Luger's	101
forgotten	101
world!	100
check,	100
afraid	100
basement	100
sticky	100
esp	100
cocktails,	100
appeared	100
stands	100
liver	100
buying	100
locations	100
(my	100
held	100
confused	99
exposed	99
awesome!	99
holiday	99
plate,	99
opportunity	99
Seafood	99
regardless	99
bday	99
charming,	99
Black	99
broccoli	99
ratings	99
sandwich,	99
refills	99
accept	99
putting	99
ricotta	99
frosting	99
youre	98
else,	98
mojito	98
DON'T	98
LOVED	98
spicy,	98
8:30	98
then,	98
charred	98
addition,	98
Out	98
introduced	98
L	98
P	98
Besides	97
venue	97
skate	97
carte	97
Instead	97
feed	97
you!	97
Forget	97
paired	97
Ordered	97
isnt	97
Grilled	97
pictures	97
improved	97
plates,	97
keeping	97
Now,	97
Give	97
n	97
tops	97
airy	97
worthy	97
Whenever	97
reccommend	96
bed	96
light,	96
calamari,	96
Food,	96
quantity	96
caramel	96
killer	96
street,	96
Waiters	96
indeed	96
GET	96
tartar	96
end,	96
peppers	96
arrival	96
UWS	96
Wait	95
dress	95
bothered	95
starter	95
high,	95
style,	95
careful	95
B	95
wasabi	95
beats	95
Brazilian	95
wrote	95
barbecue	95
entirely	95
watched	95
Still	95
cramped,	95
all!	95
preparation	95
eel	95
busboy	95
adventurous	95
AS	95
BYOB	95
enchiladas	95
piano	95
hummus	95
sounded	94
beet	94
alcohol	94
pie,	94
celebrity	94
destination	94
knowledge	94
hip,	94
squash	94
Truly	94
benedict	94
yet,	94
attempt	94
flag	94
comparable	94
(very	94
Pretty	94
8pm	94
staple	94
Spicy	94
FROM	94
mole	94
buds	94
ball	94
tacky	94
caught	94
subway	94
tequila	94
restaraunt	93
spare	93
dark,	93
$35	93
promptly,	93
UES	93
PM	93
learn	93
wow	93
Bad	93
starving	93
Me	93
glass,	93
bun	93
cafeteria	93
heading	93
River	93
horrendous	93
Italian,	93
Then,	93
alright	93
rich,	93
Corner	93
wines,	93
monkfish	93
stew	93
DELICIOUS	92
advantage	92
appeal	92
oyster	92
hungry,	92
good)	92
politely	92
whipped	92
Mario	92
remains	92
TV	92
requests	92
Brooklyn,	92
flan	92
buffalo	92
mild	92
Grimaldi's	92
weekend,	92
$14	92
mushrooms,	92
Enjoy	91
prompt,	91
saving	91
pork,	91
grand	91
Or	91
surrounded	91
Smith	91
Four	91
Sure,	91
Japan	91
hospitality	91
chip	91
sub-par	90
spilled	90
stars	90
tap	90
went,	90
arriving	90
latin	90
Cool	90
hangout	90
lamb,	90
formal	90
boyfriend's	90
non	90
waits	90
pour	90
horrible,	90
Expect	90
Shanghai	90
thinks	90
closer	90
Eat	90
upset	90
California	90
calling	90
trek	90
be,	90
Roll	90
genuine	90
visitors	90
acceptable	90
about,	90
combined	89
family,	89
managers	89
THe	89
communal	89
sleek	89
Enjoy!	89
Awesome	89
ive	89
inexpensive,	89
adding	89
remembered	89
issue	89
creative,	89
attended	89
breads	89
spectacular,	89
parmesan	89
choices,	89
better!	89
Yum	89
Margaritas	89
besides	89
NEW	89
blew	88
american	88
tucked	88
Midtown	88
hits	88
fully	88
sets	88
setting,	88
Made	88
manner	88
hasn't	88
Start	88
bitter	88
fake	88
poured	88
left,	88
tax	88
Got	88
sucks	88
tiny,	88
snotty	88
Diner	88
disappointed!	88
puts	88
flowers	88
crepe	88
Hill	88
macaroni	88
improve	87
like,	87
Mediterranean	87
drank	87
first,	87
member	87
allows	87
Probably	87
market	87
Everytime	87
over-priced	87
continued	87
remind	87
meal!	87
We're	87
courses,	87
inspired	87
owned	87
done,	87
hell	87
passing	87
WHAT	87
Mexico	87
suppose	87
OUR	87
accommodate	87
companion	87
Dos	87
pita	87
expense	86
enter	86
consisted	86
eventually	86
Christmas	86
happily	86
work,	86
co-workers	86
Kobe	86
platters	86
compliment	86
treasure	86
Recently	86
god	86
yummy!	86
Didn't	86
rabbit	86
did,	86
feet	86
unlimited	86
occasional	86
they'd	86
chorizo	86
considered	86
wonderful!	86
greek	86
truffles	86
doesnt	86
beware	86
Any	85
relaxed,	85
groups,	85
snobby	85
Tried	85
Over	85
more!	85
nowhere	85
bf	85
Rice	85
quickly,	85
dining,	85
pace	85
planned	85
flavors,	85
starts	85
pull	85
omakase	85
me!	85
bang	85
learned	85
age	85
Lounge	85
acted	85
properly	85
Irish	85
honest	85
hopes	85
King	85
addictive	84
fun!	84
Bottom	84
Spain	84
vinegar	84
watered	84
consistency	84
9pm	84
overdone	84
views	84
pointed	84
conversations	84
classics	84
lets	84
thier	84
empty,	84
timely	84
Harlem	84
$60	84
who's	84
carrot	84
posted	84
venison	84
year,	84
toro	84
wrap	83
tip,	83
season	83
Anyone	83
magnificent	83
specialties	83
Still,	83
downright	83
coats	83
finishing	83
closing	83
rings	83
jewel	83
adorable	83
tends	83
vegetarian,	83
cater	83
chair	83
peas	83
burritos	83
refilled	83
sip	83
cookie	83
server,	83
corporate	83
result	83
BACK	83
REAL	82
fishy	82
venture	82
polite,	82
vacation	82
invited	82
exceptional,	82
ignore	82
puree	82
cakes,	82
comparison	82
oysters,	82
Price	82
informative	82
LIKE	82
trap	82
balanced	82
continues	82
John	82
fault	82
ways	82
Butter	82
wait!	82
Eastern	82
fire	82
loyal	82
importantly,	82
delivers	82
Tao	82
mayo	81
tortilla	81
tips	81
hanger	81
deliciously	81
hassle	81
sampling	81
leather	81
sold	81
present	81
raspberry	81
try!	81
line,	81
tag	81
fashion	81
Soup	81
spinach,	81
eaters	81
dessert!	81
diner,	81
prosciutto	81
up!	81
eater	81
hung	81
ours	81
warmly	81
wearing	81
Veal	81
narrow	81
Tea	81
seven	81
MUCH	81
soon!	81
Stick	81
twenty	81
opened,	80
character	80
pile	80
client	80
empanadas	80
dumpling	80
toasted	80
pastas,	80
together,	80
brother	80
What's	80
success	80
Music	80
perfection,	80
OR	80
menu)	80
blow	80
response	80
faces	80
Rosa	80
pool	80
potential	80
fancy,	80
st	80
Daniel	80
loaded	79
Before	79
pre	79
dimly	79
trendy,	79
out-of-town	79
linguine	79
evenings	79
Jersey	79
caviar	79
suggestion	79
mussels,	79
example	79
pack	79
display	79
size,	79
snooty	79
TRY	79
ham	79
Village,	79
unattentive	79
Tapas	79
catfish	79
very,	79
topping	79
pizzeria	79
female	79
bank	79
executed	79
interesting,	79
intrusive	78
unprofessional	78
establishments	78
Market	78
appreciated	78
car	78
depending	78
aware	78
WORST	78
Madison	78
happening	78
Chilean	78
disappeared	78
Top	78
Bakery	78
Much	78
clueless	78
traffic	78
City,	78
delish	78
and/or	78
taco	78
moderate	78
Sweet	78
changing	78
Looking	78
Prime	78
surroundings	78
sangria,	77
arrogant	77
yummy,	77
watery	77
yellowtail	77
Jean	77
Servers	77
food's	77
reserve	77
raised	77
highest	77
balls	77
5th	77
moderately	77
approached	77
leftovers	77
board	77
bisque	77
short,	77
tasty!	77
appear	77
ain't	77
Patsy's	77
happens	77
Reservations	77
Frank	77
reasons	77
tries	77
warned	77
TOO	77
find!	77
goods	77
cab	77
Sure	77
speaking	76
rolled	76
Aside	76
burned	76
Dining	76
roof	76
steep	76
$200	76
nobody	76
noodles,	76
decadent	76
oasis	76
ever!	76
chowder	76
romance	76
food?	76
striped	76
well!	76
teas	76
diet	76
authenticity	76
flair	76
muffins	76
Are	76
do,	76
Gramercy	76
addicted	76
cherry	76
Such	76
fellow	76
Bread	76
grace	76
fills	76
refined	75
smelled	75
SoHo	75
RUDE	75
lightly	75
apologetic	75
w/o	75
delicous	75
China	75
cooked,	75
shank	75
cleared	75
someplace	75
tasteful	75
brooklyn	75
stated	75
Bass	75
professional,	75
Yorker	75
aspect	75
really,	75
di	75
ave	75
Center	75
repeatedly	75
Waitress	75
peach	75
Apple	75
linger	75
bridge	75
anything,	75
fluffy	75
promise	75
pricing	75
Samba	74
messed	74
wanna	74
options,	74
backyard	74
ending	74
LA	74
color	74
smoky	74
meatloaf	74
students	74
ruin	74
talked	74
celebrating	74
points	74
i'll	74
(you	74
focus	74
cell	74
Yama	74
sports	74
TIME	74
singing	74
almond	74
Unless	74
patron	74
100%	74
hostess,	74
discover	74
onions,	74
ravioli,	74
Luger	74
You're	73
comforting	73
while,	73
from,	73
promised	73
Hands	73
host,	73
names	73
terrific,	73
closest	73
waiter's	73
carry	73
rushing	73
welcoming,	73
often,	73
Special	73
skeptical	73
pairing	73
items,	73
(one	73
appropriate	73
Without	73
different,	73
marvelous	73
Tables	73
for?	73
virtually	73
typically	73
aged	73
definitly	73
fork	73
complement	73
ensure	73
pastrami	73
North	73
picture	72
candy	72
varies	72
9:30	72
Waited	72
waitstaff,	72
skin	72
elegant,	72
edible	72
fooled	72
kidding	72
ton	72
avenue	72
intimate,	72
May	72
leisurely	72
worry	72
chatting	72
smothered	72
searching	72
nights,	72
BIG	72
aside	72
Hudson	72
Filet	72
subpar	72
vibe,	72
9th	72
charging	72
husband's	72
Del	72
breath	72
Middle	72
that!	72
korean	71
nachos	71
truely	71
downhill	71
helping	71
ample	71
banquettes	71
select	71
crappy	71
lobster,	71
favorite,	71
watermelon	71
mellow	71
cheapest	71
ripped	71
team	71
meats,	71
cafes	71
occasionally	71
soups,	71
things,	71
parts	71
start,	71
city's	71
rushed,	71
weekly	71
U	71
greasy,	71
Recommended	71
hair	71
post	71
zucchini	71
insult	71
sucked	71
father	71
Texas	71
shots	71
uninspired	71
Burgers	71
Los	71
Da	71
temperature	70
worthwhile	70
yeah,	70
clue	70
Manager	70
WOW	70
Sit	70
carpaccio	70
dead	70
glowing	70
bass,	70
deal,	70
plantains	70
specifically	70
entering	70
frequented	70
helps	70
4th	70
Italy,	70
shredded	70
surly	70
smoking	70
row	70
presentation,	70
(all	70
McDonald's	70
sing	70
carefully	70
vegetables,	70
manage	70
utterly	70
self	70
fortune	70
claim	70
Lower	70
would've	70
ME	70
by,	70
history	70
soba	70
runs	69
unexpected	69
amongst	69
awful,	69
Ok,	69
pre-theatre	69
BEEN	69
recommending	69
Totally	69
menu!	69
personality	69
Ambiance	69
angry	69
name,	69
Main	69
seconds	69
imaginative	69
headed	69
syrup	69
joint,	69
myself,	69
$18	69
wife's	69
tradition	69
shake	69
scallion	69
bacon,	69
liking	69
unique,	69
Curry	69
according	69
bowls	69
trained	69
sticks	69
Heights	69
accident	69
laid-back	69
Bobby	69
exceeded	69
track	69
houses	69
mouth,	69
Time	69
Given	69
warmth	69
fajitas	69
Coffee	69
follow	69
nerve	68
BAD	68
France	68
competent	68
wouldnt	68
balsamic	68
becoming	68
summer,	68
knowledgeable,	68
screaming	68
ingredient	68
people)	68
lose	68
omelette	68
masala	68
elbow	68
selected	68
english	68
thin,	68
clams,	68
badly	68
available,	68
individual	68
Among	68
im	68
upstairs,	68
support	68
suprised	68
king	68
sole	68
#1	68
opinion,	68
German	68
7:30	68
Pastis	68
wondering	68
PERFECT	68
stone	68
awsome	68
areas	68
scallops,	68
attracts	67
soo	67
Spring	67
weeknight	67
i'd	67
becomes	67
lemonade	67
Decent	67
dull	67
creating	67
caliber	67
cups	67
suits	67
remarkable	67
values	67
pancakes,	67
adult	67
sipping	67
EAT	67
floors	67
ppl	67
tells	67
albeit	67
Mac	67
Pie	67
business,	67
rip	67
Bond	67
Martini	67
calm	67
Joe	67
wall,	67
dozens	67
hamburgers	67
rainy	67
cinnamon	67
Live	67
necessarily	67
Philly	67
sick	66
miserable	66
arugula	66
replaced	66
disagree	66
male	66
Cuba	66
smiles	66
chow	66
gonna	66
darn	66
meals,	66
seasoning	66
hefty	66
2)	66
Wow	66
also,	66
Trust	66
tomatoes,	66
indifferent	66
removed	66
cabbage	66
fabulous!	66
tremendous	66
stepped	66
rubbery	66
CAN	66
menus,	66
yum	66
events	66
matched	66
entre	66
herbs	66
infused	66
margaritas,	66
golden	66
flawless	66
Jackson	66
Okay,	65
pitchers	65
suit	65
NYU	65
Quite	65
sauce)	65
deals	65
Again,	65
final	65
b-day	65
Honestly,	65
control	65
customers,	65
tall	65
swordfish	65
details	65
Romantic	65
spot!	65
explanation	65
papaya	65
expertly	65
oil,	65
AFTER	65
HORRIBLE	65
served,	65
lazy	65
edge	65
mushy	65
hey,	65
million	65
broiled	65
photos	65
brisket	65
eggs,	65
unfortunately,	65
Five	65
juicy,	65
friendliest	64
smart	64
sunny	64
feature	64
Service,	64
bartender,	64
fed	64
Calamari	64
30th	64
price!	64
gravy	64
colors	64
MORE	64
mahi	64
fails	64
stools	64
BY	64
Tuscan	64
join	64
Ginger	64
lychee	64
foodie	64
standout	64
condescending	64
tone	64
tapas,	64
efficient,	64
jerk	64
worse,	64
leg	64
whom	64
right?	64
fuss	64
God	64
AN	64
greet	64
boiled	64
Hell's	64
:	64
guac	64
assorted	64
Eatery	64
lukewarm	63
teriyaki	63
America	63
conversation,	63
new,	63
handful	63
minimal	63
memories	63
something,	63
tastiest	63
toward	63
pound	63
Large	63
greatly	63
hangar	63
comped	63
7pm	63
memory	63
basis	63
legs	63
(it's	63
spoiled	63
dissappointed	63
prix-fixe	63
workers	63
touches	63
Northern	63
crammed	63
drive	63
Wow!	63
touristy	63
boot	63
ABOUT	63
incompetent	63
genuinely	63
s	63
dinner!	63
Extremely	63
passion	63
it!!	63
collard	63
over,	63
Carmine's	63
dcor	63
it!!!	63
hash	63
everyone,	62
guaranteed	62
necessary	62
panini	62
couches	62
quaint,	62
Fabulous	62
Atlantic	62
Water	62
unbeatable	62
warmer	62
cordial	62
6th	62
claimed	62
garden,	62
appears	62
wash	62
pickles	62
salty,	62
transported	62
pair	62
whose	62
distance	62
right!	62
pushed	62
spotty	62
Almost	62
layer	62
review,	62
proper	62
mark	62
soothing	62
Sicilian	62
stopping	62
wheat	62
merely	62
District	62
period	62
system	62
bright,	62
point,	62
ny	62
consistantly	62
contemporary	62
(on	62
quesadillas	62
EVERYTHING	62
branch	62
HERE	62
Agave	62
cutting	61
BLT	61
decision	61
overcooked,	61
friends!	61
bottled	61
disaster	61
bits	61
picking	61
expert	61
island	61
everything,	61
scoop	61
perfect!	61
trio	61
life,	61
$150	61
online	61
Ate	61
surrounding	61
unassuming	61
us!	61
squeezed	61
Could	61
boar	61
butter,	61
swear	61
dive	61
atop	61
WOULD	61
juices	61
north	61
Ray's	61
Jewel	61
competition	61
NJ	61
crabs	61
complimented	61
speaks	61
trout	61
(there	61
goodness	61
tossed	61
that?	60
steal	60
feast	60
THEIR	60
artichokes	60
creates	60
Birthday	60
judge	60
easier	60
indulge	60
About	60
weekends,	60
unacceptable	60
painted	60
recommend!	60
justify	60
salted	60
massive	60
confirmed	60
mignon,	60
rare,	60
colleagues	60
example,	60
oh,	60
which,	60
unfortunate	60
Hotel	60
cared	60
gross	60
counter,	60
Club	60
good;	60
early,	60
Saturday,	60
disapointed	60
Olive	60
escargot	60
crispy,	60
WORTH	60
sides,	60
York's	60
Huge	60
confit	60
oversized	60
meatpacking	60
equal	60
pairings	60
bachelorette	60
Steakhouse	60
ranks	60
Frankie	60
canned	60
Strip	60
Caminos	60
embarrassed	59
automatically	59
decoration	59
child	59
plays	59
originally	59
Dishes	59
yelling	59
international	59
bruschetta	59
privacy	59
floor,	59
York!	59
hurt	59
food)	59
July	59
hand,	59
fool	59
gathering	59
thick,	59
apps,	59
fav	59
$80	59
happier	59
showing	59
pizza!	59
pouring	59
Tasty	59
fair,	59
praise	59
gladly	59
tho	59
yogurt	59
choosing	59
show,	59
gold	59
desert,	59
ranging	59
grocery	59
knock	59
institution	59
beverage	59
product	59
lucky,	59
services	59
laugh	59
shabu	59
heavily	59
textures	59
They've	59
eastern	59
ages	59
Brasserie	59
catering	59
crabcakes	59
catered	59
lunches	59
7th	59
shakes	59
old,	58
E	58
sits	58
busboys	58
RECOMMEND	58
dates,	58
accompanying	58
Asia	58
importantly	58
$11	58
otherwise,	58
meaning	58
chinatown	58
constant	58
8th	58
dissapointing	58
tail	58
inconsistent	58
peaceful	58
mirrors	58
hundreds	58
World	58
ANY	58
A+	58
she's	58
Ever	58
Ice	58
pancake	58
low-key	58
test	58
eight	58
quail	58
impressive,	58
HAS	58
stunning	58
uses	58
chilled	58
complex	58
Owner	58
house,	58
or,	58
Bridge	58
pecan	58
process	58
fan,	58
lackluster	58
wear	58
biscuits	58
Suba	58
grits	58
General	58
ramen	58
stays	57
eateries	57
stairs	57
grown	57
Cute	57
feel,	57
machine	57
snacks	57
accomodated	57
Prix	57
answered	57
greeting	57
AM	57
generously	57
rum	57
jumbo	57
one!	57
relaxing,	57
other,	57
burning	57
providing	57
trips	57
featuring	57
Dim	57
grease	57
chosen	57
waiting,	57
occassion	57
Instead,	57
random	57
(so	57
beaten	57
tongue	57
occasion,	57
sadly	57
frills	57
celebrities	57
Worst	57
Ravioli	57
courteous,	57
them!	57
?	57
account	57
are,	57
Bouley	57
jukebox	57
oxtail	57
Buddha	57
pig	57
smiling	57
Second	57
understanding	57
loin	57
span	57
ketchup	57
won	57
EVERY	57
drenched	57
Uptown	57
with,	56
screen	56
safe	56
midnight	56
us)	56
leave,	56
knife	56
improvement	56
behavior	56
tenderloin	56
ever,	56
Located	56
sashimi,	56
O	56
Lupa	56
crusty	56
at,	56
declined	56
growing	56
WELL	56
N	56
sake,	56
shops	56
companions	56
mid	56
hood	56
steer	56
natural	56
sausage,	56
glazed	56
overcrowded	56
enjoys	56
10pm	56
volume	56
restaurant)	56
everyone's	56
renovated	56
$13	56
case,	56
falls	56
sub	56
Thanksgiving	56
Candela	56
fiancee	56
impeccable,	56
get,	56
escape	56
opposed	56
Real	56
:-)	56
Casa	56
fee	55
Waitstaff	55
silly	55
unable	55
favourite	55
sweets	55
creativity	55
Look	55
(The	55
Way	55
(this	55
dente	55
Super	55
parm	55
piping	55
custard	55
OVER	55
problem,	55
saved	55
turning	55
state	55
Valentines	55
antipasti	55
$$$	55
basics	55
timing	55
chips,	55
chances	55
enthusiastic	55
cheap!	55
Night	55
mainly	55
tikka	55
wise	55
adults	55
tasteless,	55
joy	55
compliments	55
nonetheless	55
outstanding!	55
$17	55
18%	55
UP	55
freezing	55
pate	55
g	55
C	55
Dylan	55
definetely	55
crap	55
owners,	55
candlelit	55
bamboo	55
exact	55
Cajun	55
kinks	55
Megu	55
Kin	55
Which	54
appearance	54
charges	54
surprises	54
place!!	54
PIZZA	54
hopping	54
featured	54
theres	54
Mango	54
accomodating,	54
opposite	54
someone's	54
months,	54
no,	54
Paella	54
layout	54
$45	54
cucumber	54
handed	54
NOTHING	54
shoulder	54
squeeze	54
panna	54
David	54
barbeque	54
Tomoe	54
decorations	54
pressed	54
steps	54
overlook	54
breaded	54
(maybe	54
Staten	54
find,	54
terrace	54
Maitre	54
streets	54
(only	54
convinced	54
suited	54
recently,	54
London	54
holds	54
nuts	54
inviting,	54
Town	54
bouncer	54
expanded	54
expanding	54
skimpy	54
Wow,	53
colored	53
Considering	53
2,	53
polished	53
appetizing	53
nightmare	53
culture	53
night)	53
Garlic	53
curious	53
citrus	53
Ok	53
meets	53
loose	53
vibrant	53
stretch	53
Apparently	53
India	53
upbeat	53
signs	53
admit,	53
industry	53
vintage	53
royalty	53
unobtrusive	53
rudeness	53
Peking	53
DEFINITELY	53
Warm	53
W	53
base	53
cart	53
cured	53
ribeye	53
yelled	53
remained	53
honor	53
could've	53
(I'm	53
suspect	53
(after	53
Restaurants	53
chops,	53
rose	53
Street,	53
FRESH	53
elegance	53
social	53
neighbor	53
desire	53
None	53
Pearl	53
cheerful	53
confirm	53
games	53
(to	53
minimalist	53
recommended,	53
lover,	53
tropical	53
Peasant	53
corner,	53
Hostess	53
Sorry	53
AWESOME	53
recipe	53
Tom	53
Mama	53
chewy,	52
spoon	52
so-so,	52
Jazz	52
open,	52
$$	52
retro	52
enjoy!	52
glasses,	52
factor	52
kind,	52
ultimate	52
therefore	52
modern,	52
(he	52
Seating	52
raves	52
filling,	52
content	52
variety,	52
tandoori	52
one's	52
sardines	52
blah	52
Russian	52
ticket	52
mean,	52
sizzling	52
Gras	52
garlic,	52
worried	52
soaked	52
home-made	52
fry	52
eating,	52
ragu	52
brownie	52
inventive,	52
servers,	52
tour	52
station	52
settle	52
magic	52
wraps	52
beverages	52
letting	52
Management	52
High	52
highlights	52
consists	52
D	52
Whatever	52
fritters	52
Gardens	52
adore	52
compensate	52
silverware	52
Eggs	52
baristas	52
pride	52
NYC's	52
cellar	52
interest	52
home!	52
tunnel	52
edamame	52
overlooking	52
essentially	52
oz	52
thursday	52
herself	52
EXTREMELY	52
occupied	52
issues	52
town!	52
born	52
hyped	52
lighter	52
microwave	52
pathetic	51
let's	51
Someone	51
Moroccan	51
(just	51
bonus	51
strawberries	51
greens,	51
initial	51
wished	51
tray	51
brilliant	51
lately	51
Eating	51
Add	51
Appetizer	51
meaty	51
garlicky	51
depends	51
cuz	51
broken	51
directly	51
Authentic	51
others,	51
string	51
